---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAggregateIterator.MoveNext
source: html/9a671bf9-f000-5e43-7916-61322e1ff5b6.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregateIterator.MoveNext Method

Increments the iterator to the next object in the IFCAggregate.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is another available object in this iterator.
 False if the iterator has completed all available objects.